Repository: daflecardoso/moovy_flutter
Catalog: lib/l10n/intl_*.arb
Languages: pt

source: Movements
pt: Movimentações

source: Empty Movements
pt: Sem Movimentações

# youDonTHaveMovements
source: You don't have any movements for {month}
pt: Você não tem nenhuma movimentação em {month}

source: Total Income
pt: Total Entradas

source: Total Expense
pt: Total Saída

source: Income Expense
pt: Entradas e Despesas

source: Expense
pt: Despesa

source: Income
pt: Entrada

source: Expense Description
pt: Descrição da despesa

# expenseDescriptionHint
source: Ex: Invoice Credit Card
pt: Ex: Fatura do cartão de crédito

source: Description cannot be empty.
pt: A descrição não pode ser vazia

source: Amount
pt: Valor

# amountHint
source: Ex: $150.00
pt: Ex: R$150.00

# amountDescription
source: Amount per month
pt: Valor por mês

# amountEmptyValue
source: Please type some value.
pt: Por favor digite algum valor

# dueDayExpense
source: Due day of expense
pt: Dia do vencimento

source: Due day is required
pt: Dia de vencimento é obrigatório

source: Period of expense
pt: Período da despesa

# periodOfExpenseDescription
source: If has not end date, pick the start date.
pt: Se não tem um fim, selecione apenas data inicio.

# startDateOrRangeIsRequired
source: Start or range of dates is required.
pt: Data inicio ou período é obrigatório

source: Save
pt: Salvar

source: Delete
pt: Excluir

source: Income Description
pt: Descrição da entrada

# incomeHint
source: Ex: Salary
pt: Ex: Salário

source: Income Day
pt: Dia do pagamento

source: Income Day is required
pt: Dia do pagamento é obrigatório

source: Period of income
pt: Período do pagamento

source: Settings
pt: Configurações

source: Currency
pt: Moeda

# selectCurrency
source: Select a currency
pt: Selecione uma moeda

source: American Dollar
pt: Dólar Americano

source: Brazilian Real
pt: Real

source: Language
pt: Idioma

source: Portuguese
pt: Português

source: English
pt: Inglês

source: Theme
pt: Tema

source: System
pt: Sistema

source: Light
pt: Claro

source: Dark
pt: Escuro

source: Success
pt: Sucesso

# changesWasUpdated
source: Successfull updated
pt: Alterado com sucesso

# occurrences
source: Update Occurrences
pt: Atualizar Ocorrências

# updateJustIt
source: Just it
pt: Somente essa

# updateAppOccurrences
source: All occurrences
pt: Todas as ocorrências

source: Profile
pt: Perfil
